{"hed":"Making Data Viz with d3, Flexbox, and a Serious Lack of SVG","dek":"May seem like magic.","intro":[{"type":"text","value":"A few months ago, my co-worker <a href=https://pudding.cool/author/matt-daniels/ target=_blank>Matt</a> and I were collaborating on a project. I had been building a <a href=https://bl.ocks.org/mbostock/3886208 target=_blank>stacked bar chart</a> in <a href=https://d3js.org/ target=_blank>d3.js</a>, and was seriously struggling to get the bars to stack on top of each other nicely <em>and</em> to animate from the bottom of the graphic instead of the top. For some reason, the fact that an SVG space places its (0,0) coordinates at the <em>top</em> left corner instead of the <em>bottom</em> left corner will always cause some weird mental disconnect in my brain."},{"type":"text","value":"Amid all of my frustration, Matt suggested ditching the SVG altogether, making the bars out of <code>div</code> elements with a <code>background-color</code> and aligning them using <a href=https://css-tricks.com/snippets/css/a-guide-to-flexbox/ target=_blank>Flexbox</a>. To be totally honest, I was super confused by the suggestion because it involved a few things that I honestly did not know were possible. I should have asked: <span class=question>You can make d3 graphics without SVG?</span> <span class=question>Divs can be used to make bars?</span> <span class=question>I can use flexbox to do all the alignment math for me?</span>"},{"type":"text","value":"It turns out the answer to all of those questions is <strong>yes</strong>. In that moment, I was being stubborn and eventually got the SVG to work the way I wanted, but Matt’s suggestion stuck with me. And when I actually saw it in action in one of his more <a href=https://pudding.cool/2018/05/similarity/ target=_blank>recent projects</a>, I was mind-blown. I ended up loving it so much that one of the <a href=https://pudding.cool/2018/06/makeup-shades>most recent data-viz stories</a> that I programmed contains <strong>no SVG</strong>. I’m so in love with this method (for very specific circumstances) that I wanted to shout it from the roof-tops...or at least from this blogpost."}],"need-title":"Some Important Context","need-disclaimer":"If you’re already super-familiar with the inner-workings of d3.js, DOM elements, and Flexbox, you can skip this section.","need":[{"type":"text","value":"Although I’d been using d3 to make graphics for over a year, I had some major mis-conceptions about what it can do that stopped me from fully grasping this concept early on. So here’s some things I wish I knew:"}],"need-list":["<strong>d3 manipulates DOM elements, not just SVG</strong>: In hindsight, I feel like this one should have been obvious, but I clearly missed it. It even says it right on the d3 homepage: “D3 allows you to bind arbitrary data to a Document Object Model (DOM), and then apply data-driven transformations to the document.” meaning that while d3 <em>can</em> create and manipulate DOM elements that are on an SVG plane (think <code>path</code>, <code>rect</code>, <code>circle</code> etc. elements), it can also manipulate non-SVG elements (like <code>text</code>, <code>div</code>, and <code>span</code> elements).","<strong>Flexbox arranges DOM elements in rows or columns</strong>: Unlike <a href=https://css-tricks.com/snippets/css/complete-guide-grid/ target=_blank>CSS grid</a>, Flexbox arranges items in a one-dimensional manner in either a row <em>or</em> column format. While you can use CSS-grid for the methods described in this post, I’m going to primarily focus on using Flexbox. More info on the differences can be found <a href=https://hackernoon.com/the-ultimate-css-battle-grid-vs-flexbox-d40da0449faf target=_blank>here</a>.","<strong>Flexbox can organize non-SVG DOM elements</strong>: As far as I can tell, you can’t use Flexbox to arrange objects that were created with SVG. That is, if you have a bunch of <code>rect</code> elements on your SVG, Flexbox can’t move them. But, if you have several, separate SVG elements (think <a href=https://pudding.cool/2017/04/beer/ target=_blank>small multiples</a>), Flexbox can arrange them for you."],"need-post":[{"type":"text","value":"Once I understood these two things, Matt’s suggestion made a bit more sense. I could use d3 to create/manipulate things like <code>div</code>s, <em>and</em> I could then arrange those elements using Flexbox."}],"work-title":"How Does it Work?","work":"Let’s start with a waffle chart. In this kind of graphic, we’ll use small blocks to represent a percentage of something (much like a square pie chart). For this example, we’ll say that 5% of our readers <a href=https://pudding.cool/process/resize/ target=_blank>resize their browser</a>.","waffle-html":"In your HTML file, you’ll only need a single, empty div. Remember, no need to add an SVG element.","waffle-js":"For your JavaScript, you generally need to add 100 <code>div</code> elements and somehow denote which ones will be styled a different color. In this example, we’re creating an array of 100 numbers, adding an attribute denoting whether that number is below 5, and then adding a div element for every number in the array.","waffle-css":"The magic of this method shows up here, in the CSS. At this point, we have an outer-most div called <code>waffle</code>, an inner div called <code>container</code> and 100 divs inside of <code>container</code> called <code>block</code>. Using CSS, we can define the size of our <code>block</code> and <code>container</code> elements, and use Flexbox to arrange them.","waffle-css-post":"Here, the designation <code>display: flex</code> indicates that the <code>container</code> <code>div</code> should be considered a flex container. The line <code>flex-wrap: wrap</code> indicates that the items inside of <code>container</code> should line themselves up in a row (starting in the upper left-hand corner) until they reach the end of the container (in this case, <code>width: 140px</code>), and then form a new row. If you want this process to start in the lower right-hand corner instead, use <code>flex-wrap: wrap-reverse</code>. Last, give your <code>block</code> elements a <code>width</code>, <code>height</code>, and <code>background-color</code> to make them visible.","waffle-results":"Here’s what our final graphic looks like. Feel free to inspect it to double-check that it’s only made up of <code>div</code> elements."}